Repository: Faioa/Portfolio
Catalog: src/locales/*.po
Languages: fr

source: About
fr: À propos

source: Me, Myself, and I
fr: Qui suis-je ?

source: Music
fr: Musique

source: Computer Science
fr: Informatique

source: Open my CV
fr: Ouvrir mon CV

source: My Projects
fr: Mes Projets

source: Read More
fr: Voir Plus

source: This Website
fr: Ce Site Web

source: <0/> Copied!
fr: <0/> Copié !

source: Written on {0}
fr: Écrit le {0}

source: <0/>Contact Me
fr: <0/>Contactez moi

source: <0/>Legal Notices<1/>
fr: <0/>Mentions Légales<1/>

source: Home
fr: Accueil

source: Projects
fr: Projets

source: Work In Progress
fr: Développement en Cours

source: Please activate Javascript to use the website as it depends heavily on animations and events.
fr: Veuillez activer JavaScript pour utiliser pleinement ce site, car il dépend beaucoup des animations et des évènements

source: Scroll down or hover the strings...
fr: Défilez ou survolez...

source: ...to animate the guitar!<0>(Work in Progress)</0>
fr: ...pour animer la guitare !<0>(Fonctionnalité à venir)</0>

source: Welcome!
fr: Bienvenue !

source: I hope you enjoy visiting my website!
fr: J'espère que vous apprécierez votre visite sur mon site !

source: Featured Projects
fr: Projets Phares

source: Recent Articles
fr: Articles Récents

source: <0/>Browse More Articles
fr: <0/>Parcourir Plus d'Articles

source: Thank you for your understanding.
fr: Merci de votre compréhension.

source: Contact Form
fr: Formulaire de Contact

source: First Name
fr: Prénom

source: John
fr: Pierre

source: Last Name
fr: Nom

source: Doe
fr: Dupont

source: Category
fr: Catégorie

source: Select a category
fr: Sélectionnez une catégorie

source: Subject
fr: Sujet

source: Bug Report
fr: Rapport de bug

source: Undo
fr: Annuler

source: Select a subject
fr: Sélectionnez un sujet

source: Content
fr: Contenu

source: Type your message here
fr: Écrivez votre message ici

source: Submit<0/>
fr: Soumettre<0/>

source: Search...
fr: Recherche...

source: Search
fr: Rechercher

source: Filters
fr: Filtres

source: Select the filters you want to use for your research.
fr: Sélectionnez les filtres que vous souhaitez utiliser pour votre recherche.

source: Sort By
fr: Trier Par

source: Select a sorting order
fr: Sélectionner l'ordre de tri

source: You can choose how the results are sorted with this filter.
fr: Vous pouvez choisir comment les résultats sont triés avec ce filtre.

source: Featured
fr: Articles Phares

source: You can choose if you want to search for featured articles or not.
fr: Vous pouvez choisir si vous souhaitez rechercher des articles phares ou non.

source: Posted After
fr: Publiés Après

source: Pick a date
fr: Sélectionnez une date

source: You can filter all articles posted after this date.
fr: Vous pouvez filtrer les articles publiés après cette date.

source: Posted Before
fr: Publiés Avant

source: You can filter all articles posted before this date.
fr: Vous pouvez filtrer les articles publiés avant cette date.

source: Categories
fr: Catégories

source: Select the tags
fr: Sélectionnez les mots clés

source: Apply
fr: Appliquer

source: Previous
fr: Précédent

source: Next
fr: Suivant

source: Close
fr: Fermer

source: More pages
fr: Plus de pages

source: Go to next page
fr: Aller à la page suivante

source: Go to previous page
fr: Aller à la page précédente

source: Sidebar
fr: Barre latérale

source: Displays the mobile sidebar.
fr: Affiche la barre latérale mobile.

source: Toggle Sidebar
fr: Activer la barre latérale

source: <0/>Written on {0}
fr: <0/>Écrit le {0}

source: <0/>Modified on {0}
fr: <0/>Modifié le {0}

source: The content of this page is bound to change as the project progresses.
fr: Le contenu de cette page changera au fur et à mesure de l'avancée du projet.

source: Svelte and SvelteKit
fr: Svelte et SvelteKit

source: Main Milestones
fr: Étapes Principales

source: Roadmap
fr: Feuille de Route

source: Main goals
fr: Objectifs Principaux

source: Expected difficulties
fr: Difficultés attendues

source: Incorrect range with the selected dates. Check their order and retry.
fr: Plage incorrecte avec les dates sélectionnées. Vérifiez leur ordre et réessayez.

source: Miscellaneous
fr: Divers

source: Lute Making
fr: Lutherie

source: Programming
fr: Programmation

source: Networks
fr: Réseaux

source: Website
fr: Site Web

source: Least Recently Created
fr: Plus Anciennement Créé

source: Most Recently Created
fr: Plus Récemment Créés

source: Least Recently Modified
fr: Plus Récemment Modifié

source: Most Recently Modified
fr: Plus Anciennement Créé

source: Job Opportunities
fr: Opportunités Professionnelles

source: Other
fr: Autre

source: Feedback
fr: Réactions

source: Job Offer
fr: Proposition d'Emploi

source: Tap to change language
fr: Cliquez pour changer la langue du site

source: The article with id {0} doesn't exist.
fr: L'article d'id {0} n'existe pas.

source: This platform is a mean for you to get information about my projects or myself, and a mean for me to keep a trace of my activities.
fr: Cette plateforme est un moyen pour vous d'en apprendre plus à propos de moi, et un moyen pour moi de garder une trace de mes activités.

source: I will not put to much information on this landing page to keep it minimalistic and clean. The different sections below will serve as an introduction to all the content available here.
fr: Je ne mettrai pas trop d'informations sur cette page d'accueil pour la garder minimaliste. Les différentes sections ci-dessous serviront d'introduction à tout le contenu disponible ici.

source: To learn more about me, you can check <0>this page</0>. You can also find my social media, as well as a contact form at the <1>bottom of each page</1>, if you want to inquire me about something.
fr: Pour en savoir plus sur moi, je vous invite à consulter <0>cette page</0>. Vous pouvez également consulter mes réseaux sociaux ou utiliser le formulaire de contact situé <1>en bas de chaque page</1> pour m'envoyer un message directement.

source: Flux studio is a soon-to-be developed <0>Digital Audio Workstation</0> using <1>Rust</1>. My aim is to create a top-notch DAW that can be used for playing and learning music. My goals are ambitious, but I will do my best to see this project through nonetheless.
fr: Flux Studio est une <0>Station de Travail AudioNumérique</0> qui sera bientôt développée en utilisant <1>Rust</1>. Mon objectif est de créer une STAN de qualité qui peut être utilisée pour composer et apprendre à jouer de la musique. Mes objectifs sont ambitieux, mais je ferai de mon mieux pour mener ce projet à bien malgré tout.

source: This website is both a portfolio and a blog developed with <0>Svelte</0> and <1>SvelteKit</1>. I will post updates on my projects and experiences, as well as anything else I find interesting. It is also a way for you to contact me. This project is an opportunity for me to experiment with web development.
fr: Ce site est à la fois un portfolio et un blog, développé avec <0>Svelte</0> et <1>SvelteKit</1>. Je publierai des mises à jour sur mes projets et mes expériences, ainsi que tout ce que j'apprend d'intéressant au quotidient. Ce projet est une opportunité pour moi d'expérimenter le développement web avec des outils populaires et modernes. C'est aussi un moyen pour vous de me contacter.

source: I'm sorry, but there's no available article yet. Please wait a few days for some content to be published!
fr: Je suis désolé, mais il n'y a pas d'article pour le moment. Veuillez attendre quelques jours pour que plus de contenu soit publié !

source: First of all, my name is Matthieu Dartois and I am a {0}-year-old French student in Paris. The purpose of this page is to provide you with some additional information about me. I'm not quite sure what information should be included on this page or how it should be presented, but I'll do my best. Don't hesitate to contact me if you have any question.
fr: Avant tout, je m'appelle Matthieu Dartois et je suis un étudiant français de {0} ans à Paris. L'objectif de cette page est de vous fournir quelques informations supplémentaires sur moi. Je ne suis pas tout à fait sûr de quelles informations devraient figurer sur cette page ou comment elles devraient être présentées, mais je ferai de mon mieux. N'hésitez pas à me contacter si vous avez des questions.

source: I suppose I should talk about myself a bit, since that's kind of the goal of this page. However, I don't want to seem pretentious, and I'm not comfortable with exposing too much of myself. So, I'll be brief and get straight to the point. I am passionate about music and computer science, but a lack of free time during my Master's degree meant that I couldn't play music or do anything else. This had a negative impact on me, and I felt a little regretful, lost and depressed about not achieving anything. That is why I decided to take a year off from university. I joined a music organisation to take violin lessons, and I study computer science in my remaining free time. My first goal is to complete this website/portfolio before moving on to the main topic: Flux Studio. The name may be temporary, but it represents what I want to achieve: a smooth, versatile tool for playing music. This is a way for me to combine both worlds during my year off and explore lots of different tools and subjects that I wouldn't encounter in my classes. I will use the articles to share my achievements, the problems I encounter, and the knowledge I have acquired, hoping that you will learn something from them and/or get your feedback to help me learn more.
fr: Je suppose que je devrais parler un peu de moi, puisque c'est le but de cette page, mais je ne veux pas paraître prétentieux et je ne suis pas à l'aise de m'exposer trop. Donc, je serai bref et j'irai droit au but. Je suis passionné par la musique et l'informatique, mais le manque de temps libre pendant mon master a été synonyme de ne pas pouvoir jouer de la musique, ni faire autre chose à vrai dire. Cela a eu un impact négatif sur moi, et j'ai un peu déprimé de cette situation et du fait de ne rien avoir accompli pour moi-même. C'est pourquoi j'ai décidé de prendre une année de césure à l'université. J'ai rejoint une association musicale pour suivre des cours de violon et j'étudie l'informatique pendant mon temps libre. Mon premier objectif est de terminer ce site/portfolio avant de passer au sujet principal : Flux Studio. Le nom est peut-être temporaire, mais il représente ce que je veux réaliser : un outil fluide et polyvalent pour jouer de la musique. C'est un moyen pour moi de combiner les deux mondes pendant mon année de césure et d'explorer différents outils et sujets que je ne rencontrerais pas dans mes cours. J'utiliserai mes articles pour partager mes réalisations, les problèmes que je rencontrerai et les connaissances que j'aurai acquises. J'espère ainsi que vous apprendrez quelque chose et que vous me donnerez vos commentaires pour m'aider à progresser.

source: My relationship with music is complicated. It has always been an important part of my life, yet I have never fully committed to playing it. I was motivated during high school, but the pandemic put a sudden stop to that. During my first years at university, I played the guitar occasionally and suddenly felt the urge to buy all kinds of musical instruments. To this day, I still don't know how to play most of them. I hope that the music theory lessons I am taking now will provide me with a foundation that will make me feel more confident with any instrument — at least I won't be completely lost. I cannot imagine my life without an instrument or music in the background. With Flux Studio, I hope to combine my hobby with my work by providing a tool for anyone to play and learn music. Perhaps one day I will be able to compose pieces too! I'm not sure whether to add a music theory section to this website with the tips and tricks that I learn or find, since there are already plenty of good online resources, and I don't want to create something substandard that might contain incorrect information.
fr: Ma relation avec la musique est complexe : cela a toujours été une partie importante de ma vie, mais je ne me suis jamais investi complètement dedans lorsque j'en avais l'occasion. J'ai connu une période de motivation au lycée, mais la crise sanitaire du Covid-19 y a mis un terme soudainement. J'ai appris à jouer de la guitare en autodidacte, en utilisant YouTube et des tablatures en ligne, il y a 7 ans maintenant. Lors de mes premières années d'université, j'ai eu l'envie irrésistible d'acheter de nombreux instruments de musique. À ce jour, je ne sais jouer de la plupart d'entre eux... chose avec ces instruments. Je ne peux pas imaginer ma vie sans écouter ou faire de la musique. C'est la raison pour laquelle je compte développer Flux Studio pour allier passion et travail. Mon objectif est de créer un outil de production et d'apprentissage accessible à tous. Je ne suis pas certain d'ajouter une section de théorie musicale à ce site : il existe de nombreuses sources d'informations précieuses sur Internet, et je ne pense pas être capable de proposer quelque chose d'intéressant qui ne risquerait pas de contenir d'erreurs.

source: I discovered programming in my first year at university, studying Python and C. I found the first Python course terrible, but loved the C one. I therefore took the computer science course at my university for my second and third years of my bachelor's degree. I completed two internships during this time, which broadened my horizons, particularly the second one, which was in a laboratory. I will write an article about it later, as it was really interesting. To give you a brief overview, my team needed to create autonomous, dynamic mesh networks for use by firefighters in isolated areas without an Internet connection. As you might have guessed, I specialised in networks for my master's degree and successfully completed the first year. I cannot say which aspect interests me the most, but I find the whole field fascinating. I plan to make the most of my year off by studying <0>MIT open courses</0> and scientific papers in other fields, such as cybersecurity and artificial intelligence.
fr: J'ai découvert la programmation avec Python et le C lors de ma première année de licence. Le cours de Python était un peu archaïque, à l'inverse de celui de C qui m'a donné envie de m'intéresser à l'informatique en général. J'ai donc poursuivi avec une licence DANT (Développement d'Applications et Nouvelles Technologies) en apprentissage, plutôt orientée vers le développement web, et j'ai effectué un stage chaque année pour avoir un aperçu du monde professionnel. Ces deux expériences m'ont permis d'élargir mes horizons et d'envisager d'autres domaines. Le second, en particulier, m'a donné envie de m'intéresser aux réseaux. J'écrirai un article plus approfondi sur ce sujet plus tard, mais pour résumer brièvement, l'équipe du laboratoire devait mettre en place un réseau maillé dynamique et autonome pour répondre au problème de la connectivité des pompiers lors de l'exploration de certains sinistres. Ce projet m'a vraiment plu, c'est pourquoi j'ai poursuivi avec un master Réseaux, que je suis toujours en train de compléter. Je compte tirer le meilleur parti profiter de cette année de césure en étudiant des articles scientifiques et en suivant des <0>cours libres du MIT</0> pour explorer d'autres domaines tels que la cybersécurité ou l'IA.

source: On the subject of artificial intelligence, I admit that I use it myself sometimes. I have a mixed view of it: it might be useful for saving time, but it is counterproductive in a learning context because you don't put much thought into your work. That is mainly why I avoid using it too much. On this website, for instance, I encountered some issues with SvelteKit's behaviour when routing pages, so I used Anthropic's Claude chatbot to gain insight into the situation and resolved it myself. AI doesn't create the project, but it certainly saves me time on research when I hit a wall. The environmental impact in terms of energy and pollution should also be considered seriously, in my opinion. I also avoid using too much AI for this reason.
fr: Sur le sujet de l'intelligence artificielle, j'avoue que je l'utilise moi-même parfois. J'en ai une opinion mitigée : elle peut être utile pour gagner du temps, mais elle est contre-productive dans un contexte d'apprentissage car on ne réfléchit pas suffisamment à son travail. Sur ce site, par exemple, j'ai rencontré des problèmes avec le comportement de SvelteKit lors du routage des pages, j'ai donc utilisé le chatbot Claude d'Anthropic pour mieux comprendre la situation et je l'ai résolu moi-même. L'IA ne créer pas le projet, mais elle m'économise très certainement du temps de recherche quand je suis bloqué et que la situation requiert plus d'expérience que je n'en possède. À mon sens, l'impact environnemental de l'IA devrait aussi être considéré sérieusement. Pour conclure, si c'est quelque chose que je peux apprendre à faire, ou que je sais déjà faire, l'IA n'est pas nécessaire.

source: This page is still a little confusing for me so I will work on it later when I finally figure out what I should write.
fr: Cette page est encore un peu confuse pour moi donc je travaillerai dessus plus tard quand je saurai enfin ce que je devrais écrire.

source: This page showcases the projects I'm most proud of. More content will be added over time. You can find out more about each project on their respective page. For instance, you will find information about my motivations and goals, as well as a roadmap of the features (<0>which is still a work in progress</0>). Please feel free to give me your feedback. Thank you!
fr: Cette page présente les projets dont je suis le plus fier. Plus de contenu sera ajouté au fil du temps.Vous pouvez en savoir plus sur chaque projet sur leur page respective. Par exemple, vous trouverez des informations sur mes motivations et mes objectifs, ainsi qu'une feuille de route des fonctionnalités (<0>qui sont toujours en cours de développement</0>). N'hésitez pas à me faire des retours. Merci !

source: You can filter the resulting articles based on their tags (the articles will match all tags).
fr: Vous pouvez filtrer les articles en fonction de leurs mots clés (les résultats possèderont tous les mots clés).

source: This website is my way of justifying taking a year off from university. If you're not sure what I mean, you can find out more on <0>this page</0>. It is also a way for me to keep track of my activities, projects, and associated goals. I think it could be useful for business partners or recruiters who want to find out more about a candidate before making an offer. If you are interested in this, I am definitely the person for the job - don't hesitate to contact me! More seriously, I will develop this website in my free time to promote myself and my projects.
fr: Ce site est ma façon de justifier mon année de césure à l'université. Si vous n'êtes pas sûr de ce que je veux dire, vous pouvez en savoir plus sur <0>cette page</0>. C'est aussi un moyen pour moi de suivre mes activités, mes projets et mes objectifs qui y sont associés. Je pense également que cela pourrait être utile pour les partenaires commerciaux ou des recruteurs qui voudraient en savoir plus sur un candidat avant de faire une offre. Si cela vous intéresse, je suis définitivement la personne qu'il vous faut : n'hésitez pas à me contacter ! Plus sérieusement, je développerai ce site web sur mon temps libre pour mettre en avant mes projets.

source: I was curious about learning how to use a web development framework, so this is also the perfect opportunity to make something with the ones I had in mind: Svelte and SvelteKit. I've heard a lot of good things about them, so I thought I'd give them a try, and I have to say, I was impressed. Even though I didn't have much experience with Javascript or HTML/CSS, they made it really easy to build something decent. I'll probably write an article about it later, when I'm a bit more experienced and confident in explaining things, but I encourage you to check <0>their website</0> for more details.
fr: J'étais curieux d'apprendre à utiliser un framework de développement web moderne, c'est donc aussi l'occasion parfaite de créer quelque chose avec ceux que j'avais en tête : Svelte et SvelteKit. J'ai entendu beaucoup de bonnes choses à leur sujet, alors j'ai eu envie d'essayer de développer avec, et je dois dire que j'ai été impressionné. Même si je n'avais pas beaucoup d'expérience avec Javascript ou HTML/CSS, ils ont rendu vraiment facile la construction de quelque chose de correct. Je vais probablement écrire un article à ce sujet plus tard, quand j'aurai un peu plus d'expérience et que je serai plus confiant dans l'explication des concepts, mais je vous encourage à consulter <0>leur site web</0> pour plus de détails.

source: My first goal is to create a fully functional application comprising all its pages, error handling and efficient back-end logic. Then, I will try to make the entire application responsive. Finally, I will add quality-of-life features such as multiple language support and a more efficient UI. Once all of this has been achieved, I will update the style periodically (perhaps with seasonal themes) and add content in the form of articles and projects. I envision the articles feature as interactive: the main point is to share my knowledge and experiences and showcase my hobbies, but most importantly, to learn from your feedback and constantly improve.
fr: Mon premier objectif est de créer une application complètement fonctionnelle comprenant toutes les pages de contenu, le traitement des erreurs et une logique back-end efficace. Ensuite, j'essaierai de rendre l'ensemble de l'application responsive pour les utilisateurs sur mobile. Enfin, j'ajouterai des fonctionnalités d'amélioration de l'expérience utilisateur telles que la prise en charge de plusieurs langues et une interface plus adéquate. Une fois que tout cela sera réalisé, je mettrai à jour le style périodiquement (peut-être avec des thèmes saisonniers) et ajouterai du contenu sous forme d'articles et de projets. J'ensisage la fonctionnalité des articles comme interactive : l'essentiel est de partager mes connaissances et mes expériences et de mettre en valeur mes loisirs, mais surtout, d'apprendre de vos commentaires et ainsi de m'améliorer constamment.

source: In addition to the social media links at the bottom of every page, you can use this contact form to get in touch with me directly. Please feel free to use it if you have any questions or if anything is unclear. <0/>Thank you!
fr: En plus des liens vers mes réseaux sociaux en bas de chaque page, vous pouvez utiliser ce formulaire pour me contacter directement. N'hésitez pas à l'utiliser si vous avez des questions ou si quelque chose n'est pas clair. <0/>Merci !

source: This email address will only be used to reply to your message and will not be shared in any way.
fr: Cette adresse e-mail ne sera utilisée que pour répondre à votre message et ne sera pas partagée de quelque façon que ce soit.
