Repository: Faioa/Portfolio
Catalog: src/locales/*.po
Languages: fr

source: Flux Studio is a soon-to-be developed <0>Digital Audio Workstation</0> using <1>Rust</1>. My goal is to develop a first-class DAW for playing and learning music. My goals are ambitious, but I will do my best to see this project through. As you may have guessed, music is my passion, and I want it to be a central element of my life, whether through playing music or developing this software.
fr: Flux Studio est une <0>Station de Travail AudioNumérique</0> qui sera bientôt développée en utilisant <1>Rust</1>. Mon objectif est de développer une STAN de qualité pour jouer et apprendre la musique. Mes objectifs sont ambitieux, mais je ferai de mon mieux pour mener ce projet à bien. Comme vous l'avez peut-être deviné, la musique est ma passion et je veux qu'elle soit un élément central de ma vie, que ce soit en jouant de la musique ou en développant ce logiciel.

source: This is also an opportunity for me to learn Rust, which seems like a really promising programming language. You can find out more at <0>their website</0> directly for more details, but it might just become my go-to language for almost every use cases. Despite the fact that the Rust community is relatively new, the Rustaceans (the name of the Rust developers' community) are very active, and the available resources are constantly growing. There is even debate about whether this language should be included in the Linux Kernel. I will leave you to do your own research on this subject, as this is not the main topic of this page.
fr: C'est aussi une occasion pour moi d'apprendre à programmer en Rust, qui semble être un langage vraiment prometteur. Vous pouvez en savoir plus directement sur <0>leur site web</0> pour plus de détails, mais il pourrait bien devenir mon langage de prédilection pour presque tous les cas d'usage à l'avenir. Malgré le fait que la communauté Rust soit relativement nouvelle, les Rustaceans (le nom de la communauté des développeurs Rust) sont très actifs et les ressources disponibles s'accroissent constamment. Il a même été inclus dans le noyau Linux. Je vous laisse faire votre propre recherche sur ce sujet, car ce n'est pas le sujet principal de cette page.

source: My first goal is to successfully process and generate live audio signals. I want to be able to manipulate the gain and recognise or decompose the frequencies within the signal. The next step would be to add a graphical user interface (GUI) for manipulating the signals. I think the GUI will be the most challenging aspect of this project. As you may have gathered from this website, UI/UX design is not my forte. However, I don't plan on creating a substandard GUI, even if it takes me a long time to refine it. I am still thinking about the next steps in this project. I have lots of ideas, but I don't yet know the intermediate steps, and I need to be realistic about which features I can actually implement.
fr: Mon premier objectif est de traiter et générer avec succès des signaux audio en direct. Je veux être capable de manipuler le gain et de reconnaître ou décomposer les fréquences dans le signal. L'étape suivante serait d'ajouter une interface utilisateur graphique (GUI) pour manipuler les signaux. Je pense que l'interface graphique sera l'aspect le plus difficile de ce projet. Comme vous l'avez peut-être compris sur ce site web, le design UI/UX n'est pas mon point fort. Cependant, je ne prévois pas de créer une interface graphique de qualité inférieure, même si cela me prend beaucoup de temps pour la raffiner. Je réfléchis encore aux prochaines étapes de ce projet. J'ai beaucoup d'idées, mais je ne connais pas encore les étapes intermédiaires, et je dois être réaliste quant aux fonctionnalités que je peux réellement implémenter.

source: As I have never used Rust before, it is difficult for me to anticipate the issues I will encounter on this project. However, I think the main issues will stem from the relatively new Rust ecosystem, since many of its crates are not yet mature. For example, there is no consensus on which crate to use for creating graphical interfaces for applications. Many different projects are being developed to meet the needs of the community, each with their own particular features, but none of them are particularly notable. I need to do a lot of research for this, and I will probably publish an article about my findings.
fr: Comme je n'ai jamais utilisé Rust auparavant, il m'est difficile d'anticiper les problèmes que je rencontrerai avec ce projet. Cependant, je pense que les principaux problèmes proviendront de l'écosystème Rust relativement nouveau, car beaucoup de ses crates ne sont pas encore matures. Par exemple, il n'y a pas de consensus sur la crate à utiliser pour créer des interfaces graphiques pour les applications. De nombreux projets différents sont en cours de développement pour répondre aux besoins de la communauté, chacun avec ses propres particularités, mais aucun ne se démarque particulièrement. Je dois faire beaucoup de recherche pour cela et je vais probablement publier un article sur mes conclusions.

source: The second obstacle that I fear the most is developing a cross-platform application. From the outset, I intend to develop Flux Studio with modular code to simplify the management of the various crates required for each operating system. However, I am still anxious about the moment when I attempt to optimise the application. I have no experience of cross-platform development so far, so my worries may be unfounded.
fr: Le deuxième obstacle que je crains le plus est de développer une application multiplateforme. Dès le départ, j'ai l'intention de développer Flux Studio avec un code modulaire pour simplifier la gestion des diverses crates requises pour chaque système d'exploitation. Cependant, je suis toujours anxieux à propos du moment où j'essaierai d'optimiser l'application. Je n'ai aucune expérience de développement multiplateforme jusqu'à présent, donc mes inquiétudes pourraient être infondées...
